Tekla.Structures.ModelInternal.Operation.ExportIFCFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.ModelInternal.Operation.IFCExportBasePoint,System.Boolean,System.Boolean)
IFC export from all objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.ModelInternal.Operation.IFCExportBasePoint,System.Boolean,System.Boolean)
IFC export from selected objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromObjects(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.ModelInternal.Operation.IFCExportBasePoint,System.Boolean,System.Boolean)
IFC export from given objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ModelObjects:  List of model objects to export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.ModelInternal.Operation.IFCExportBasePoint,System.Boolean,System.Boolean)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
FilterName:  Filter file name for model objects to export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFC(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,System.Boolean,Tekla.Structures.ModelInternal.Operation.IFCExportBasePoint,System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.Operation.AddToPourUnit(Tekla.Structures.Model.PourObject,System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Adds model objects as part of pour unit
Model object types accepted are assembly types except cast in situ,
reinforcements of different kind, components and bolts
inputPour: the instance of pour to add objects to.
objectsToBeAdded: the list of model objects to be added.
Throws System.ArgumentException: Throw exceptions if Pour or object has invalid ID,
do not exist in model or not valid object type.

Tekla.Structures.ModelInternal.Operation.GetBasePoints
Gets the available base points as a list.
Returns: The list of available base points.

Tekla.Structures.ModelInternal.Operation.GetBasePointByName(System.String)
Returns:

Tekla.Structures.ModelInternal.Operation.GetBasePointByGuid(System.Guid)
Returns:

Tekla.Structures.ModelInternal.Operation.CreateBasePoint(Tekla.Structures.ModelInternal.BasePoint)
Returns:

Tekla.Structures.ModelInternal.Operation.ModifyBasePoint(Tekla.Structures.ModelInternal.BasePoint)
Returns:

Tekla.Structures.ModelInternal.Operation.DeleteBasePoint(Tekla.Structures.ModelInternal.BasePoint)
Returns:

Tekla.Structures.ModelInternal.Operation.GetDotBasePoint(Tekla.Structures.ModelInternal.BasePoint)
Returns: